---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mechanical.MechanicalSystem
source: html/557ae19f-3f61-945e-f3bd-be4d233f0d52.htm
---
# MechanicalSystem Methods

Add elements into the system and connect them with the system using given connectors.